In [3]:
import numpy as np
import pandas as pd

Series = Columns

In [4]:
ser = pd.Series([1, 2, 3])

ser

0    1
1    2
2    3
dtype: int64

Dataframe

In [5]:
A = [1, 2, 3]
B = [4, 5, 6]
C = [A , B]
D = {'A': A , 'B': B}

In [6]:
df = pd.DataFrame(C, columns=['a', 'b', 'c'], index= ['A', 'B'])
df

   a  b  c
A  1  2  3
B  4  5  6

In [7]:
df = pd.DataFrame(D)
df

   A  B
0  1  4
1  2  5
2  3  6

Rename()

In [8]:
df = pd.DataFrame(D).rename(columns={'A':'Alfa', 'B':'Betta'})
df

   Alfa  Betta
0     1      4
1     2      5
2     3      6

In [9]:
D = [{'A': A , 'B': B}, {'A': [15, 16, 18] , 'B': [20, 21, 23]}]
df = pd.DataFrame(D)
df

              A             B
0     [1, 2, 3]     [4, 5, 6]
1  [15, 16, 18]  [20, 21, 23]

In [10]:
employees = pd.read_csv('Class6Files/inputfile.txt')
employees

        Ismi  Year_Of_Exprience
0  Hikmatyor                  6
1   Zokirjon                  7
2       Ozod                 11
3     Azamat                  8

In [11]:
research = pd.read_csv('https://www.stats.govt.nz/assets/Uploads/Annual-enterprise-survey/Annual-enterprise-survey-2021-financial-year-provisional/Download-data/annual-enterprise-survey-2021-financial-year-provisional-size-bands-csv.csv')
research

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)
...,...,...,...,...,...,...,...
17023,2021,all,All Industries,j_Grand_Total,Total income,757504,DOLLARS(millions)
17024,2021,all,All Industries,j_Grand_Total,Total expenditure,654404,DOLLARS(millions)
17025,2021,all,All Industries,j_Grand_Total,Operating profit before tax,85116,DOLLARS(millions)
17026,2021,all,All Industries,j_Grand_Total,Total assets,2512677,DOLLARS(millions)
17027,2021,all,All Industries,j_Grand_Total,Fixed tangible assets,591351,DOLLARS(millions)

In [12]:
research.head(6)

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)
5,2011,A,"Agriculture, Forestry and Fishing",a_0,Total expenditure,7618,DOLLARS(millions)

In [13]:
research.tail(6)

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
17022,2021,all,All Industries,j_Grand_Total,"Sales, government funding, grants and subsidies",674890,DOLLARS(millions)
17023,2021,all,All Industries,j_Grand_Total,Total income,757504,DOLLARS(millions)
17024,2021,all,All Industries,j_Grand_Total,Total expenditure,654404,DOLLARS(millions)
17025,2021,all,All Industries,j_Grand_Total,Operating profit before tax,85116,DOLLARS(millions)
17026,2021,all,All Industries,j_Grand_Total,Total assets,2512677,DOLLARS(millions)
17027,2021,all,All Industries,j_Grand_Total,Fixed tangible assets,591351,DOLLARS(millions)

In [14]:
research.sample(5, random_state=15)

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
1969,2012,F,Wholesale Trade,b_1-5,Total assets,4116,DOLLARS(millions)
13841,2019,R,Arts and Recreation Services,i_Industry_Total,Fixed tangible assets,6504,DOLLARS(millions)
14833,2020,L,"Rental, Hiring and Real Estate Services",b_1-5,Rolling mean employees,8799,COUNT
1743,2012,C,Manufacturing,d_10-19,Operating profit before tax,204,DOLLARS(millions)
10829,2017,all,All Industries,j_Grand_Total,Salaries and wages paid,99941,DOLLARS(millions)

In [15]:
research.index.to_numpy()

array([    0,     1,     2, ..., 17025, 17026, 17027], dtype=int64)

In [16]:
research.columns.to_numpy()

array(['year', 'industry_code_ANZSIC', 'industry_name_ANZSIC',
       'rme_size_grp', 'variable', 'value', 'unit'], dtype=object)

In [17]:
research.value.to_numpy()

array(['46134', '0', '279', ..., '85116', '2512677', '591351'],
      dtype=object)

In [18]:
year = research['year']
year

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
17023    2021
17024    2021
17025    2021
17026    2021
17027    2021
Name: year, Length: 17028, dtype: int64

In [19]:
print(research.dtypes)
print('\n\n')
year.dtype

year                     int64
industry_code_ANZSIC    object
industry_name_ANZSIC    object
rme_size_grp            object
variable                object
value                   object
unit                    object
dtype: object

dtype('int64')

In [20]:
sample = pd.Series([1, 5, 'Sss', np.NaN])
sample.apply(type)

0      <class 'int'>
1      <class 'int'>
2      <class 'str'>
3    <class 'float'>
dtype: object

## Nan funksiyalari

In [21]:
sample.isna()
sample.notna()

0     True
1     True
2     True
3    False
dtype: bool

In [28]:
year = research['year']
year.astype('float')

0        2011.0
1        2011.0
2        2011.0
3        2011.0
4        2011.0
          ...
17023    2021.0
17024    2021.0
17025    2021.0
17026    2021.0
17027    2021.0
Name: year, Length: 17028, dtype: float64

In [29]:
sample.fillna(0)

0      1
1      5
2    Sss
3      0
dtype: object

In [49]:
sample.fillna(0)\
.astype(str)

0      1
1      5
2    Sss
3      0
dtype: object

In [ ]:
(sample.fillna(0)
 .astype(str)
)

In [57]:
sample.isna().any()

True

In [58]:
sample.hasnans

True

In [59]:
sample.dropna()

0      1
1      5
2    Sss
dtype: object

In [60]:
sample.dropna(inplace=True)

In [61]:
sample

0      1
1      5
2    Sss
dtype: object

In [62]:
C = [1, 2, 3, np.NaN]
D = [4, 5, 6, np.NaN]
E = [7, 8, np.NaN, np.NaN]
F = {'C': C , 'D': D, 'E':E}
dfn = pd.DataFrame(F)
dfn

     C    D    E
0  1.0  4.0  7.0
1  2.0  5.0  8.0
2  3.0  6.0  NaN
3  NaN  NaN  NaN

In [63]:
dfn.isna()

       C      D      E
0  False  False  False
1  False  False  False
2  False  False   True
3   True   True   True

In [64]:
dfn.isna().sum()

C    1
D    1
E    2
dtype: int64

In [66]:
dfn.isna().any().any()

True

In [67]:
dfn.dropna()

     C    D    E
0  1.0  4.0  7.0
1  2.0  5.0  8.0

In [69]:
dfn.dropna(how='all')

     C    D    E
0  1.0  4.0  7.0
1  2.0  5.0  8.0
2  3.0  6.0  NaN

In [70]:
ser_methods = set(dir(pd.Series))
df_methods = set(dir(pd.DataFrame))

len(ser_methods & df_methods)

367

In [72]:
dfn.size

12

In [73]:
dfn.shape

(4, 3)

In [74]:
len(dfn)

4

In [75]:
dfn.count()

C    3
D    3
E    2
dtype: int64

In [76]:
sample.value_counts()

1      1
5      1
Sss    1
dtype: int64

In [77]:
dfn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C       3 non-null      float64
 1   D       3 non-null      float64
 2   E       2 non-null      float64
dtypes: float64(3)
memory usage: 224.0 bytes

In [78]:
dfn.min()

C    1.0
D    4.0
E    7.0
dtype: float64

In [79]:
dfn.min(numeric_only = True)

C    1.0
D    4.0
E    7.0
dtype: float64

In [80]:
dfn.describe()

         C    D         E
count  3.0  3.0  2.000000
mean   2.0  5.0  7.500000
std    1.0  1.0  0.707107
min    1.0  4.0  7.000000
25%    1.5  4.5  7.250000
50%    2.0  5.0  7.500000
75%    2.5  5.5  7.750000
max    3.0  6.0  8.000000

In [82]:
dfn.sum(axis='columns')

0    12.0
1    15.0
2     9.0
3     0.0
dtype: float64